package regTest;

import java.util.Scanner;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Test {
/*
    * 1. Á¤±Ô Ç¥Çö½Ä(Regular Expression, ÁÙ¿©¼­ Regex, RegExp)
    *   : Æ¯Á¤ÇÑ ±ÔÄ¢À» °¡Áø ¹®ÀÚ¿­ÀÇ ÁıÇÕÀ» Ç¥ÇöÇÏ±â À§ÇÑ Çü½Ä¾ğ¾î
    * 
    * 2. ¹®¹ıÀº ¼¼°¡Áö·Î ³ª´®
    *    1) ÆĞÅÏ ±×´ë·Î¸¦ ¸ÅÄª : ´Ü¾î ±×´ë·Î¸¦ ÆĞÅÏÀ¸·Î »ç¿ë
    *    2) ¸ŞÅ¸¹®ÀÚ ¹× ¼ö·® ÇÑÁ¤ÀÚ¸¦ Àû¿ë : Á¤±Ô½Ä ÆĞÅÏ¿¡ ¾²ÀÌ´Â Æ¯º°ÇÑ ÀÇ¹Ì¸¦ Áö´Ï´Â ¸ŞÅ¸ ¹®ÀÚ·Î Æø³ĞÀº ÆĞÅÏ¿¡ ¸ÅÄ¡
    *    3) ±×·ì ¹× look around ±â´ÉÀ» Àû¿ë : ÆĞÅÏÀÇ ÀÏºÎ¸¦ ±×·ìÀ¸·Î ¹­°Å³ª, Æ¯Á¤ ÆĞÅÏÀÇ ¾Õ µÚ·Î ´Ù¸¥ ÆĞÅÏÀÌ ¿À´Â Á¶°ÇÀ» ´õÇÔ
    * 
    * 3. Á¤±Ô½Ä ¸ŞÅ¸ ¹®ÀÚ
    * ^ : ¹®ÀÚ¿­ÀÇ ½ÃÀÛ
    * $ : ¹®ÀÚ¿­ÀÇ Á¾·á
    * . : ÀÓÀÇÀÇ ÇÑ ¹®ÀÚ(´Ü, \´Â ³ÖÀ» ¼ö ¾øÀ½)
    * * : ¾Õ ¹®ÀÚ°¡ ¾øÀ» ¼öµµ ¹«ÇÑÁ¤ ¸¹À» ¼öµµ ÀÖÀ½
    * + : ¾Õ ¹®ÀÚ°¡ ÇÏ³ª ÀÌ»ó
    * ? : ¾Õ ¹®ÀÚ°¡ ¾ø°Å³ª ÇÏ³ª ÀÖÀ½
    * [] : ¹®ÀÚÀÇ ÁıÇÕÀÌ³ª ¹üÀ§, []³»¿¡¼­ ^°¡ ¼±ÇàÇÏ¿© Á¸ÀçÇÏ¸é notÀ» ³ªÅ¸³¿
    * {} : È½¼ö ¶Ç´Â ¹üÀ§
    *      {n} - n¹ø ¹İº¹
    *      {n,} - n¹ø ÀÌ»ó ¹İº¹
    *      {n,m} - n¹øÀÌ»ó m¹ø ÀÌÇÏ ¹İº¹
    * () : ¼Ò°ıÈ£ ¾ÈÀÇ ¹®ÀÚ¸¦ ÇÏ³ªÀÇ ¹®ÀÚ·Î ÀÎ½Ä
    * | : ÆĞÅÏ ¾È¿¡¼­ or¿¬»êÀ» ¼öÇàÇÒ ¶§ »ç¿ë
    * \s : °ø¹é ¹®ÀÚ
    * \S : °ø¹é ¹®ÀÚ°¡ ¾Æ´Ñ ³ª¸ÓÁö ¹®ÀÚ
    * \w : ¾ËÆÄºªÀÌ³ª ¼ıÀÚ
    * \W : ¾ËÆÄºªÀÌ³ª ¼ıÀÚ¸¦ Á¦¿ÜÇÑ ¹®ÀÚ
    * \d : ¼ıÀÚ [0-9]¿Í µ¿ÀÏ
    * \D : ¼ıÀÚ¸¦ Á¦¿ÜÇÑ ¸ğµç ¹®ÀÚ
    * \ : ¿ª½½·¡½Ã ´ÙÀ½¿¡ ÀÏ¹İ ¹®ÀÚ°¡ ¿À¸é Æ¯¼ö¹®ÀÚ·Î Ãë±ŞÇÏ°í
    *     ¿ª½½·¡½Ã ´ÙÀ½¿¡ Æ¯¼ö¹®ÀÚ°¡ ¿À¸é ±× ¹®ÀÚ ÀÚÃ¼¸¦ ÀÇ¹Ì
    * (?i) : ¾Õ ºÎºĞ¿¡ (?i)¶ó´Â ¿É¼ÇÀ» ³Ö¾îÁÖ¸é ´ë¼Ò¹®ÀÚ¸¦ ±¸ºĞÇÏÁö ¾ÊÀ½
    * 
    * 
    * 4. ±×¸²À¸·Î È®ÀÎÇÒ ¼ö ÀÖ´Â »çÀÌÆ®
    *    https://regexper.com/
    *    
    * 5. ÀÚÁÖ ¾²ÀÌ´Â ÆĞÅÏ
    *    1) ¼ıÀÚ¸¸ : ^[0-9]*$    
    *    2) ¿µ¹®ÀÚ¸¸ : ^[a-zA-Z]*$ 
    *    3) ÇÑ±Û¸¸ : ^[°¡-ÆR]*$
    *    4) ¿µ¾î & ¼ıÀÚ¸¸ : ^[a-zA-Z0-9]*$
    *    5) E-Mail : ^[a-zA-Z0-9]+@[a-zA-Z0-9]\.[a-zA-Z0-9]$
    *    6) ÈŞ´ëÆù : ^01(?:0|1|[6-9]) - (?:\d{3}|\d{4}) - \d{4}$
    *    7) ÀÏ¹İÀüÈ­ : ^\d{2,3} - \d{3,4} - \d{4}$
    *    8) ÁÖ¹Îµî·Ï¹øÈ£ : \d{6} \- [1-4]\d{6}
    *    9) IP ÁÖ¼Ò : ([0-9]{1,3}) \. ([0-9]{1,3}) \. ([0-9]{1,3}) \. ([0-9]{1,3})
    * 
    */
	
	public static void main(String[] arg) {
		Scanner sc = new Scanner(System.in);
		System.out.println("¾Æ¹«°ªÀÌ³ª ÀÔ·ÂÇÏ¼¼¿ä:");
		String inputStr = sc.nextLine();
		System.out.println(inputStr);
	
//		1. Matcher¿¡¼­ Á¦°øÇÏ´Â find()¸Ş¼Òµå ½á¼­ ÇØº¸±â
//		Pattern p = Pattern.compile("(^[0-9]+$)");
//		Matcher m = p.matcher(inputStr);
//		
//		if(m.find()) {
//			System.out.println(inputStr);
//		}else {
//			System.out.println("Á¤±Ô½Ä¿¡ ¾î±ß³²");
//		}
//		
//		2. Pattern¿¡¼­ Á¦°øÇÏ´Â matches¸Ş¼Òµå ¾²±â
		if(Pattern.matches("([0-9]{1,3}\\.([0-9]{1,3})", inputStr)) {
			System.out.println(inputStr);
		}else {
			System.out.println("Á¤±Ô½Ä¿¡ ¾î±ß³²");
		}
	
	}
	
	
}



























